{
  "professor": "Scott Jackson",
  "reviews": [
    "Had 5 assignments all semester none in the last 3 months. I think he had too many classes and kinda went a wall and gave no assignments past week 6. It probably will not be like this for the next semesters but it was very easy.",
    "I really liked Scott! He wasn't the best lecturer - so GO TO HIS OFFICE HOURS! I cannot express enough how crucial it is to Scott's office hours. He's super flexible and approachable as well. Just make sure you at least somewhat understand the course material, and you'll do fine.",
    "Nice dude but slightly boring. His classes didn't seem too structured there was a lot of TBD on the syllabus and he didn't come to class on mondays since he had another class to teach. But his gradings was good, follow the rubric and you'll get an A.",
    "Scott is a horrible lecturer and I learned mostly from the TAs in this class. Also, the grading is terrible! It is the end of the semester and I have not received one grade. His class is very disorganized. I would not recommend Scott.",
    "Doesn't update grades during semester its the last week of school and I haven't had one assignment graded. If you want to learn python he does a pretty decent job in class and there are GSS oppurtunties to get better understanding outside of class(though I have never attended a session).  He seems like one of the teachers that will give you a good grade based on effort. Other than the lack of knowledge where i stand on this class, the professor is understanding and workload isn't crazy.",
    "Horrible grading. It is the end of the semester and I still have no grade in this course. Absolutely no feedback. His lectures are useless. He barely explains anything and he is boring. He just codes and reads aloud everything he types. Would not recommend him.",
    "Very nice and approachable",
    "Do not take this professor. He is overall a nice guy but if you have anxiety about your grade do not take him at all. He does not release your grades until the final week (exam week) and gives you little wiggle room to raise your grade. Again, he is a very nice guy but just the overall structure of this class was too much to handle on top of other classes because you don't know if your failing or passing the class until it's too late.",
    "Don't take him. Terrible lecturer and still hasn't posted a single grade for my class when its literally finals week. He can not be a real professor. Please avoid him.",
    "I DO NOT recommend taking this professor. This was his first year teaching this course which is understandable but he provided zero feedback throughout the entire semester. We did not get anything graded and had no grades put in as of the last day of classes. He kept on promising that he would grade things but never ended up doing so. So it was very difficult to know how you're doing in the class. If you do take him, I recommend going to his office hours because they were helpful. He's very nice when you talk to him one on one but the whole course was very disorganized. It consisted of 3 word count projects and consolidation projects. The lectures are recorded.",
    "Such a great professor, course is super easy to follow. prof is such a great help and he pushes back assignment so it can be turned in. He definately make coding fun",
    "Goated professor!! Scott is really chill and super supportive, it’s easy to tell he cares about his students’ understanding of the material. The workload wasn’t crazy, we had about 12 assignments throughout the whole semester (including the projects) and coding projects build off of each other. He had a system where your grades were based on how many points you score based on the course concepts, so if you didn’t score a lot of points for one project it didn’t matter because you could gain those points back with following projects.\r \r The only issue I had is that we would get literally no feedback on your projects unless you asked, which was fine in the end because Scott would tell you exactly what you need to work on when you go to him. I agree with the other comment saying to use his office hours when you need to!! He’s very happy to help!",
    "Professor Jackson is a very supportive and patient instructor. He goes out of his way to reassure students and provide clear guidance in programming, which I found incredibly helpful. His explanations are always thorough, and he takes the time to ensure everyone understands the material.\r \r However, there is a significant downside: he never returns graded assignments, no matter how many times we ask. Despite his frequent apologies, none of us received any feedback on our assignments throughout the entire semester. This lack of feedback started from the very first week and persisted until the end of the term, which was quite frustrating.\r \r If he could improve on this aspect, he would be an outstanding professor. Overall, if you can manage without timely feedback on your work, you'll benefit a lot from his teaching.",
    "I'll be honest, I took him in the spring and it was only his second semester teaching. He was a nice guy but would always delay grading. The whole class had no grades until the day final grades were do. But his grading system is fair, lets say you miss one or multiple coding assignment, you have the opportunity to get a grade for them still if you show that you can implement the code in the next assignment. He grades off a fundamentals list, so technically you can submit the final project and make sure to include everything in the list and get an A (that's lowkey what I did) but I don't recommend it, since you literally have no other assignments to back you up if you do that.",
    "Very nice professor, willing to work with students and help them. Assignments can be a little bit unclear, but he leaves them very open to what you want to do. He never really published grades, which made it hard to know how you were doing in the class. I think overall an easy grader",
    "First: expected grade not A+ because *I* could mess some things up (busy semester)! This is my first 400-level INST class and I'm taking MATH401 (Justin's Notes) this semester, too!\r \r I had Dr. Jackson for INST314 Statistics for Information Science, and I loved it! He is so passionate about what he teaches that he has a hard time fitting all of the content into a 15 week course. Fortunately, he is vigilant of this and provides ample time to complete assignments as long as you start them when they're released. Additionally, he moves deadlines back when necessary and before anyone can get a chance to complain. This is all part of a grading philosophy that he has, described below. What's important is that he gives more than enough time on graded assignments. I have accommodations provided by the ADS. While they aren't needed, it is good conduct to let him know.\r \r He has an unusual method of grading. I know a few counties in Maryland are/were testing a new way of grading in public school called \"Standards-Based Grading.\" If you know what that is, this is what he does. All graded assignments are a set of objectives rather than a rubric. The grading is binary: either the objective was met or it was not (the policy is usually \"point awareded if effort shown\"). The top-down approach he takes to the class means that there is a \"point pool\" that contains all assignments for the semester. Rather than screwy math to figure out your grade prospects in his courses, you just need to check the remaining assignments and compare that to a letter-grade table on the syllabus.\r \r INST314 and INST462 require R, the statistical computing language. He has a few weeks of onboarding before he gets started with the appilcations. During this time he uses lecture to introduce both contemporary and historical theory and context. The discussions are for monitoring the onboarding progress and ensure a practical R tutorial.\r \r Hope I helped!",
    "Grading system was unclear, and the lectures and discussions didn't help much with assignments.",
    "Lectures didn't help with anything, grades weren't updated so I couldn't tell what I was doing wrong or right, and assignments weren't clear.",
    "Much of the material learned was complicated, and a lot of the people in the class had a lot of advanced prior coding knowledge and were able to complete assignments without much worry. Professor is nice and willing to work with students, but grades haven't been updated as of after November.",
    "Scott is a genuinely good person who cares about his students and is passionate about teaching this subject. The issues i do have though is the lack of grading... we are already in November and i believe we have one grade in so far, with the lack of grading comes the lack of feedback, i have zero clue how i am doing. He is helpful though and is there if you need help with during his office hours. For lectures i tend to zone out and not learn, i feel the class isnt engaging enough to be motivated to want to learn the skill.",
    "I honestly have no idea how I am doing in this class and its already November. Scott's grading system is very unusual as he doesn't use canvas/ELMs to update grades, he instead uses a \"point\" system but it seems like he gives a lot of opportunities to improve prior scores, so I do appreciate that. There are no exams in this class and he does not require attendance in his lectures, which are pretty boring btw. He does record helpful tutorials on almost every coding assignment which I find help me more than attending his lectures. Overall, hes a really nice guy and replies to emails/questions really quickly its just the class is structured kind of odd so I have no clue where I stand...",
    "He's a good professor but the grading system is horrendous, I have no idea how i'm doing in the class and the semester ends in a few days. Only 2 main assignments have been graded so far and I'm seriously wondering how he's gonna grade the final project in time. He also doesn't allow late submissions so if you miss one deadline your grade could look like it's tanked but you can make up the points in the following assignments.",
    "I do not recommend taking this professor. Do not take this professor. He doesn’t grade assignments til last minute. I was fine as of yesterday and my grade dropped a whole 10%. Grading system is very odd and I am afraid for my grade in this class. This class should’ve been easy but his grading system made it very difficult and we’d get negative points which wasn’t helpful.",
    "Scott is a very nice person, a very good lecturer, and a good person. I found his class very interesting as this was the first coding class I had ever taken. But one drawback. The grading system is terrible. He does not grade your assignments for all semester but will at the very end. He knows this too which is good so he made sure everyone will pass who did their coding assignments. I would suggest him as a professor just be aware of this before taking the class.",
    "I would not recommend taking this professor. He is a very nice person but his grading system is extremely odd where he does a \"points\" system. It was nice that you were able to gain points back in the next assignments but since he grades so late and the majority of his assignments are based on the prior, we do not get feedback in time to know what to improve on in the next assignment. Also, I found it unfair that you could get negative points on an assignment because that means if you quite literally did not put in the effort and did not submit the assignment, you might get a higher grade than someone who actually tried but they just had a lot of \"anti-patterns\". He has many opportunities to improve your grade but it is extremely difficult to tell how you are doing in the class. The semester literally ended and we still don't have the majority of our grades. With the final due a few days before grades are finalized, I wonder how he will manage to grade the final project AS WELL AS our previous assignments in time. Save yourself the stress and do not take him if you don't want your gpa to plummet.",
    "Professor Jackson is very nice and accessible through discord. I enjoyed the flexibility of this course and how understanding he was. However, as everyone has been saying, a major issue with him is grading. I still don't know what grade I actually have currently and have no idea what my final grade could be . At this point in the semestest that is unaceptable. I did appreaciate the ability to earn points back, but, as others have also said, that is hard to do when grades aren't put in until after the next assignment is due.",
    "Professor Jackson is really kind and understanding, but the late grading for assignments has been incredibly stressful to deal with. Most of the coding assignments (including the final project) depend on previous feedback, but I have yet to receive feedback on assignments from weeks prior. Without knowing what to improve or work on, I don't know what my progress is or what my final grade will even be. I appreciated the extra credit assignments to compensate, but not having grades in from a month before classes have finished is unacceptable. I also felt that the lectures did not really help with learning how to code, and I personally would have preferred more in person coding exercises as opposed to hours of tutorial videos to watch on our own time.",
    "Scott Jackson is a very nice person, like others have put it. He very forgiving and always does his best to adjust assignments. It his third semester teaching Inst126 (if I recall our meeting correctly) so he is still improving the course as he goes. His grading and timing is one that hugely affects his class. This class would be a breeze if his grading system wasn’t very confusing. Since he does very poorly on grading, many people are reviewing him pretty low. I say take Scott Jackson if you want leniency. He’s very lenient and very communicative when you reach out to him.",
    "This is one of the weirdest classes I’ve taken. The grading system was so weird and confusing because you can earn negative points on assignments. Scott had a big issue with grading on time and this was important because you need the previous assignments feedback to work on future assignments. I think the class is not difficult and Scott knew that there was a problem in the grading and really wanted to help us. He gave us extra points that somewhat offset his tardy grading. Overall not a difficult course.",
    "Prof Jackson is really nice, understanding, and helpful. Any issues or problems you have he will help you through and make sure you get it resolved. I genuinely believe he has a passion for teaching us the material and wants us to learn but like others have stated the grading part is lacking. Personally, I did not mind the slow grading as he is very lenient on deadlines and grading so it's kind of a give-and-take. The classes were fine, it is not the most interesting material so it was whatever. The discussion sessions allowed us to practice what we learned during class. There is a final group project at the end which is easy, probably can do it yourself if need be.\r \r TL;DR Professor Jackson is really helpful, nice, and understanding. While he puts in grades slowly everything else makes up for it.",
    "He was a nice person. However, he would take a very long time to grade stuff which was very stressful and annoying because the assignments would build off of each other. So, we wouldn't know how to approach our new assignments without his feedback. He also had antipoints which is very unnecessary and confusing.",
    "He is a very nice and chill guy. However, he would take soooo long to grade assignments. This was very annoying because the assignments would build off of each other. So without his feedback, we didn't know what to fix for the new assignments. He also graded using anti-patterns which to this day makes no sense to me. We also didn't know our grade until after the semester ended.",
    "I like Scott! It is accurate that he is not known for grading quickly and uses a silly grading rubric (many professors in INFO enjoy doing that) but he is genuinely easy to deal with outside of that. As someone who struggled with programming prior to this class I believe I became a lot more comfortable with practicing good programming habits and understanding the context behind it all. As for the grading... it's a 100s level INFO course. There's not a whole lot to keep you from passing if you follow instruction.\r \r He goes through BASH usage for file management, GIT, Python from basic printing to sets/tuples, good material. Not many assignments which I like as I can focus on learning. However in my class he unfortunately skipped over APIs which was listed in the syllabus and I'm not sure why as I assume it's a vital lesson to cover. Weird guy sometimes."
  ]
}