{
  "courses": [
    "INST327",
    "INST126",
    "EXST030",
    "INST123",
    "INST733",
    "INST490",
    "INST208M",
    "INST228",
    "INST123",
    "INST326",
    "INST327",
    "INST228",
    "INST408M",
    "INST123",
    "INST227",
    "INST228",
    "INST327",
    "INST408M",
    "INST408W",
    "INST728W",
    "INST408M",
    "INST327",
    "INST227",
    "INST228",
    "INST327",
    "INST733",
    "INST327",
    "INST227",
    "INST228",
    "INFM603",
    "INST327",
    "INST408M",
    "INST228",
    "INST327",
    "INST388E",
    "INST410",
    "INST733",
    "INST204S",
    "INST228",
    "INST327",
    "INST388E",
    "INST408B",
    "INST410"
  ],
  "average_rating": 4.1304,
  "type": "professor",
  "reviews": [
    {
      "professor": "Pamela Duffy",
      "course": "INST126",
      "review": "She has a great personality and really cares for her students. Her teaching is mainly centered around creating labs so students can get hands-on python experience. No final, just a group project. ",
      "rating": 5,
      "expected_grade": "A",
      "created": "2019-11-12T21:01:39Z"
    },
    {
      "professor": "Pamela Duffy",
      "course": "INST327",
      "review": "She's  great. Very helpful. Makes sure you understand the material instead of just knowing what to do. Very lab centered class",
      "rating": 5,
      "expected_grade": "A",
      "created": "2019-12-18T12:28:53Z"
    },
    {
      "professor": "Pamela Duffy",
      "course": "INST327",
      "review": "Duffy is a good teacher who cares about her students, and gives very fair (and open book) assessments and assignments. Databases can be a pretty dry subject but Duffy does her best to make the course interesting, and it is one of the most useful courses in the major. ",
      "rating": 5,
      "expected_grade": "A+",
      "created": "2019-12-21T17:55:49Z"
    },
    {
      "professor": "Pamela Duffy",
      "course": "INST327",
      "review": "Excellent professor! Highly recommend!",
      "rating": 5,
      "expected_grade": "A+",
      "created": "2019-12-23T22:33:00Z"
    },
    {
      "professor": "Pamela Duffy",
      "course": "INST123",
      "review": "Not a very interesting lecturer, but very reasonable in terms of grading.  Class was well taught and easy.",
      "rating": 5,
      "expected_grade": "A+",
      "created": "2020-05-03T16:48:53Z"
    },
    {
      "professor": "Pamela Duffy",
      "course": "INST327",
      "review": "Great professor",
      "rating": 5,
      "expected_grade": "",
      "created": "2020-11-21T22:23:34Z"
    },
    {
      "professor": "Pamela Duffy",
      "course": "INST327",
      "review": "Class was easy if programming comes easily to you. The group project was irritating at times, but that was because of flaky group members. Otherwise good course, easy online quizzes, and no exams.",
      "rating": 5,
      "expected_grade": "A+",
      "created": "2021-10-11T23:22:20Z"
    },
    {
      "professor": "Pamela Duffy",
      "course": "INST123",
      "review": "Firstly, very easy course. However a TON of bullshit work (ex: discussions). Duffy is a very nice professor and will help you out when needed. I cant speak much for her lectures though cause tbh i didnt even go to them.",
      "rating": 4,
      "expected_grade": "A",
      "created": "2021-12-24T21:34:08Z"
    },
    {
      "professor": "Pamela Duffy",
      "course": "INST327",
      "review": "i literally love her she is so caring and takes her time to help you understand. Definitely take a class you need with her if possible.",
      "rating": 5,
      "expected_grade": "A+",
      "created": "2021-12-24T22:15:44Z"
    },
    {
      "professor": "Pamela Duffy",
      "course": "INST123",
      "review": "Easiest class I've taken in my entire life. You don't ever have to attend lecture.\r\n\r\nHowever, this class was the worst class I've ever taken. Pamela Duffy/Vedat Diker are stuck in the past with how they teach. Frankly, they have no idea how students actually learn, and they assign a stupid amount of pointless work which teaches you absolutely nothing.\r\n\r\nLong ass discussion boards every two weeks, required presentations which are nothing but busy work, and you're required to attend discussions every week, where literally all you do is wait until the TA gives you answers for work that you could just do yourself at home. Discussions in this class were the worst thing I've ever done in school or at UMD in general. Worst class I've ever taken. ",
      "rating": 1,
      "expected_grade": "A+",
      "created": "2022-05-07T20:09:34Z"
    },
    {
      "professor": "Pamela Duffy",
      "course": "INST327",
      "review": "She is the most caring professor I have ever met. Although I admit that her lectures could be somewhat useless because of the large number of knowledge you can get only from the elms pages, the more you interact with her, the more love you will have for her. Most assignments are easy, even if you meet any problem you can quickly solve it during office hours. The only hard part of this course is that sometimes you have to deal with shitty teammates.",
      "rating": 5,
      "expected_grade": "A+",
      "created": "2022-09-09T02:46:56.331043Z"
    },
    {
      "professor": "Pamela Duffy",
      "course": "INST123",
      "review": "easy class just lots of busy work. professor duffy is great though, she's very considerate and understanding and just wants the best for her students. she really wants you to succeed. the class is filled with busy work like weekly quizzes, biweekly discussion posts, & biweekly group presentations that are done online and can be finished in 30 minutes. there is a group project due at the end and you have check ins and progress reports throughout the semester but my group only met a couple times and we were able to finish everything on time. make sure you have a good group, i got lucky and even though we only met a few times we were super productive and agreed on everything so the work was well split and it went really smooth. you won't have any problems with professor duffy though, i had her and professor diker so they switched every week with who was lecturing. lecture does get boring & there's mandatory discussions every week but everyone is super helpful.",
      "rating": 5,
      "expected_grade": "A",
      "created": "2023-01-26T20:41:51.789277Z"
    },
    {
      "professor": "Pamela Duffy",
      "course": "INST327",
      "review": "Good teachers and gives extension. I don't like the sjw articles we have to read.",
      "rating": 5,
      "expected_grade": "A",
      "created": "2023-05-16T17:30:56.767139Z"
    },
    {
      "professor": "Pamela Duffy",
      "course": "INST327",
      "review": "She is a very knowledgeable and considerate professor. I agree with others responses that we have a lot of busy work. However, its there to compensate for the harder assignments/project work. As long as you have a capable group, you'll be fine with the semester long project. The TA's are available and reliable.",
      "rating": 5,
      "expected_grade": "A+",
      "created": "2023-05-23T18:08:23.151786Z"
    },
    {
      "professor": "Pamela Duffy",
      "course": "INST327",
      "review": "Professor Duffy is so sweet and she makes her class as simple as possible. She provides tons of resources and you can tell she wants her students to do well. She is also very understanding if you are having any issues. I took this class online over the summer and it was very manageable.",
      "rating": 5,
      "expected_grade": "A",
      "created": "2023-09-05T14:42:04.968006Z"
    },
    {
      "professor": "Pamela Duffy",
      "course": null,
      "review": "INST408M REVIEW\r\n\r\n\r\nThis course needs more detail. The class consists of in-person lectures, weekly class assignments that are done together in a class, three major take-home assignments, and three larger project assignments that follow a similar style to the homework assignments. The issue with this course is that there isn't really a clear direction in which it wants to go. The lecture slides aren't very helpful, and nearly all of the readings are random and don't correlate with what's being covered in class. Easily, the worst part of the course was the agpss part of the course. There needs to be more content that students can reference, such as recorded lectures and lecture videos, considering the class only meets once a week. Overall, the course wasn't too bad, but it felt rushed and unfinished at times. Dr. Diker would normally go on for over an hour, and Duffy would speed-run the remaining slides after Dr. Diker would leave. The class overall is not bad, just rough when one group assignment has the potential to tank your grade.",
      "rating": 3,
      "expected_grade": "",
      "created": "2023-12-18T02:56:22.698421Z"
    },
    {
      "professor": "Pamela Duffy",
      "course": "INST327",
      "review": "The course was co-taught between Duffy and Diker. Duffy did the recorded lectures for our section and Diker did the in-person lectures. Personally I found this course to be quite hard and apparently this is an unpopular opinion but I thought 326 was better than 327. The lecture vids were really hard for me to watch, I would often get bored and couldn't follow along with what was happening. The lecture vids and understanding the material are the hardest part of the course but the in-person labs and discussion board posts are basically easy grade boosters to help balance out the difficulty.",
      "rating": 4,
      "expected_grade": "B+",
      "created": "2023-12-20T18:42:18.666479Z"
    },
    {
      "professor": "Pamela Duffy",
      "course": "INST327",
      "review": "Professor Duffy is a pleasant lecturer. The class as a whole was a headache. The semester-long group project was very unpleasant.",
      "rating": 3,
      "expected_grade": "A-",
      "created": "2023-12-29T02:50:12.911175Z"
    },
    {
      "professor": "Pamela Duffy",
      "course": "INST327",
      "review": "Professor Duffy does a great job making the material easy to understand. The assignments are very educational and really reinforce what you learn. This class focuses heavily on SQL and isn’t too difficult if you stay on top of things. To succeed, make sure to watch the lecture videos, complete the quizzes before class, and follow along with the in-class code examples and skeleton files provided. Don’t hesitate to ask for help in ELMS or Piazza. Both the TA's and professors are very supportive. Additionally, shoutout to TA Angela! She is amazing and very knowledgeable, and explains concepts clearly. Each discussion is mandatory, and we start with 15 minutes to try the lab exercises on our own. After that, the TA walks through them step by step, which is super helpful. Additionally, there is a semester-long database design project. Make sure to pick a good group within your class section early on, or you’ll be placed randomly. Some parts of the project require meeting up and working on the same device, so it’s important to have a cooperative group. The project can get challenging if group members don’t pull their weight.",
      "rating": 5,
      "expected_grade": "A+",
      "created": "2025-05-01T17:57:17.940228Z"
    },
    {
      "professor": "Pamela Duffy",
      "course": "INST327",
      "review": "I'm not entirely sure as to why Professor Duffy has good reviews. She is such a boring professor. All she does is reads off slides, and speaks in such a monotone manner. Her lectures are not interesting and simply mimic what is spoken in the video quizzes. I preferred Professor Diker over her, but unfortunately, she teaches most of the course. She put more effort into reporting half the class for being in a GroupMe than to ensuring her lessons are engaging. If you are able to, do not take Professor Duffy for this class. She's not worth the mental and academic stress.",
      "rating": 1,
      "expected_grade": "B-",
      "created": "2025-05-02T15:16:53.271210Z"
    },
    {
      "professor": "Pamela Duffy",
      "course": "INST327",
      "review": "Horrendous teacher, don't get how she is 4.3 stars. I took her because I got a recommendation from a friend, as well as the good PlanetTerp reviews. She creates a GroupMe for the class, then accuses half the class for cheating because we asked questions in it? I stopped going to lecture but she tries to make jokes mid lecture and all of them are bricks. Although she knows the material and can somewhat teach, she's just miserable to have, just find a better professor (not hard). She needs to wrap it up at this point",
      "rating": 1,
      "expected_grade": "A",
      "created": "2025-05-09T00:33:06.648921Z"
    },
    {
      "professor": "Pamela Duffy",
      "course": "INST327",
      "review": "There’s one required discussion, optional lectures (in my opinion), and a semester-long project. Most of the work is asynchronous, so it’s pretty manageable. I actually liked the assignments, they’re straightforward and teach you exactly what you need to know. You don’t interact with the professors much (there are two), but Professor Duffy stands out as super understanding and clear about expectations. She’s chill, and overall I enjoyed the class.",
      "rating": 5,
      "expected_grade": "A",
      "created": "2025-05-13T00:00:04.657302Z"
    },
    {
      "professor": "Pamela Duffy",
      "course": "INST327",
      "review": "I feel upset because Professor Duffy is overall a kind person and not a horrible teacher. However, that being said, it felt like she was really unresponsive to elms messages (her preferred communication) and had poor communication with not only her students but her TAs as well. I was thankful to have a wonderful discussion TA to help me during this class. As someone said too, there was a big academic dishonesty case in the class, and I was a part of it simply for being in the group chat. I do not blame her for what had happened, but I do feel a little bitter over the fact I begged for help and had such bad communication to resolve the matter. Other than that, I did enjoy the textbook and think it is an easy read for the class. PLEASE pick people who have good work ethics for the group project, I am very thankful I had such kind and hardworking teammates, it makes the class way more enjoyable.",
      "rating": 3,
      "expected_grade": "A",
      "created": "2025-05-13T18:46:08.990830Z"
    }
  ],
  "name": "Pamela Duffy",
  "slug": "duffy_pamela"
}